/*
25.01.2025
C++
Настройка интегрированной среды VS Code и компилятора g++ по стандарту C++14. 
Написание первой программы, ее компиляция и исполнение.
OK
*/


// Первая программа на языке С++
#include <iostream>

int main() {                                    // точка входа в программу

    std::cout << "Hello, World!" << std::endl;  // вывод информации в стандартный выходной поток

    return 0;                                   // завершает main() со значением 0
}



/*
Компиляция файла
    
    Ctrl + Shift + B

Code Runner
Компиляция и запуск программы 

    Ctrl + Alt + N

*/